Merge pull request #3 from bommer-ai/AB-patch-1
Upgrade docs with rich MkDocs Material components
